{
    "url": "https://techcrunch.com/2020/11/02/alphabets-x-details-project-amber-a-quest-for-a-single-biomarker-for-depression-that-fell-short-of-its-goal/",
    "text": "Alphabet's X details Project Amber, a quest for a single biomarker for depression that fell short of its goal Darrell Etherington @etherington / 7 days Alphabet's X (the Google-owner's so-called \"Moonshot Factory\") published a new blog post today about Project Amber, a project it's been working on over the past three years — the results of which it's now making available open source for the rest of the mental health research community to learn from, and hopefully build upon. The X project sought to identify a specific biomarker for depression — it did not accomplish that (and the researchers now believe that a single biomarker for depression and anxiety likely didn't exist), but X is still hoping that its work on using electroencephalography (EEG) combined with machine learning to try to find one will be of benefit to others. X's researchers were hoping that depression, like other ailments and disorders, might have a clear biomarker that would help healthcare professionals more easily and objectively diagnose depression, which would also then hopefully make it more easily and consistently treatable. With EEG, there was some precedent, via studies done in labs using games designed specifically for the purpose, in which people with depression seemed to consistently demonstrate a lower measure of EEG activity in response to effectively winning the games. These studies seemed to offer a path to a potential biomarker, but in order to make them actually useful in real-world diagnostic settings, like a clinic or a public health lab, the team at X set about improving the process of EEG collection and interpretation to make it more accessible, both to users and to technicians. What is perhaps most notable about this pursuit, and the post today that Alphabet released detailing its efforts, is that it's essentially a story of a years-long investigation that didn't work out — not the side of the moonshot story you typically hear from big tech companies. In fact, this is perhaps one of the best examples yet of what critics of many of the approaches of large tech companies fail to understand — that some problems are not solvable by solutions with analogs in the world of software and engineering. The team at X sums up its learnings from the years-long research project in three main bullet points about its user research, and each of them touch in some way on the insufficiency of a pure objective biomarker detection method (even if it had worked), particularly when it comes to mental illness. From the researchers: Mental health measurement remains an unsolved problem . Despite the availability of many mental health surveys and scales, they are not widely used, especially in primary care and counseling settings. Reasons range from burden (\"I don't have time for this\") to skepticism (\"Using a scale is no better than using my clinical judgement\") to lack of trust (\"I don't think my client is filling this in truthfully\" and \"I don't want to reveal this much to my counsellor\"). These findings were in line with the literature on measurement-based mental health care. Any new measurement tool would have to overcome these barriers by creating clear value for both the person with lived experience and the clinician. There is value in combining subjective and objective data . People with lived experience and clinicians both welcomed the introduction of objective metrics, but not as a replacement for subjective assessment and asking people about their experience and feelings. The combination of subjective and objective metrics was seen as especially powerful. Objective metrics might validate the subjective experience; or if the two diverge, that in itself is an interesting insight which provides the starting point for a conversation. There are multiple use cases for new measurement technology. Our initial hypothesis was that clinicians might use a \"brainwave test\" as a diagnostic aid. However, this concept got a lukewarm reception. Mental health experts such as psychiatrists and clinical psychologists felt confident in their ability to diagnose via clinical interview. Primary care physicians thought an EEG test could be useful, but only if it was conducted by a medical assistant before their consultation with the patient, similar to a blood pressure test. Counsellors and social workers don't do diagnosis in their practice, so it was irrelevant to them. Some people with lived experience did not like the idea of being labelled as depressed by a machine. By contrast, there was a notably strong interest in using technology as a tool for ongoing monitoring — capturing changes in mental health state over time — to learn what happens between visits. Many clinicians asked if they could send the EEG system home so their patients and clients could repeat the test on their own. They were also very interested in EEG's potential predictive qualities, e.g. predicting who is likely to get more depressed in future. More research is needed to determine how a tool such as EEG would be best deployed in clinical and counseling settings, including how it could be combined with other measurement technologies such as digital phenotyping. X is making Amber's hardware and software open-source on GitHub, and is also issuing a \"patent pledge\" that ensures X will not bring any legal action against users of the EEG patents related to Amber through use of the open-sourced material. It's unclear (though unlikely) that this would have been the result had Amber succeeded at finding a single biomarker for depression, but perhaps in the hands of the broader community, the work the team did on rendering EEG more accessible beyond specialized testing facilities will lead to other interesting discoveries.",
    "title": "Alphabet's X details Project Amber, a quest for a single biomarker for depression that fell short of its goal"
}