{
    "url": "https://interestingengineering.com/this-one-time-neuron-treatment-reversed-parkinsons-disease-in-mice",
    "text": "Researchers have developed a method that allows them to create neurons, the cells in an adult brain that control how we move and think, according to a recent study published in the journal Nature. The findings could prove to be a massive breakthrough in the way we treat degenerative diseases such as Parkinson's disease.\r\n\r\nUltimately, the scientists hope to reverse symptoms of these diseases by applying their findings to gene therapy and introducing the cells back into damaged brains.\r\n\r\nRELATED: NEW RESEARCH SHOWS PARKINSON'S DISEASE ORIGINATES IN THE GUT\r\n\r\nStunning early results with Parkinson's disease\r\nResearchers at the University of California San Diego demonstrated the method they used for converting the supporting cells in the brain, called astrocytes — which have no cognitive function — into neurons, the brain's vital information processing cells.\r\n\r\nTheir report shows that the one-time gene therapy permanently reversed Parkinson’s symptoms in a mouse model of the disease.\r\n\r\nIt's worth saying twice: mice treated in this study were cured of Parkinson's disease within three months after a single treatment. Moreover, they remained symptom-free for the rest of their lives. The fact that control mice in the experiments showed no improvement lends weight to the findings.\r\n\r\n“I was stunned at what I saw,” William Mobley, a UCSD neurosciences professor said in a press release. “This whole new strategy for treating neurodegeneration gives hope that it may be possible to help even those with advanced disease.”\r\n\r\nTransforming different cell types into neurons\r\nThe UCSD scientists — led by Xiang-Dong Fu, professor of cellular and molecular medicine at UCSD — found that switching off the production of a protein called PTB in laboratory cell cultures allowed them to transform other cell types into neurons.\r\n\r\nFollowing this discovery, the scientists decided to experiment with mice with movement deficiencies stemming from a lack of dopamine-producing neurons, whose loss is also responsible for the onset of Parkinson's. The researchers injected a stretch of DNA in the region of the brain responsible for motor control. It was designed to shut down the PTB gene into a harmless virus that would carry it into the mouse's brain cells.\r\n\r\nThis allowed for the conversion of astrocytes, which raised the number of neurons by almost a third and restored dopamine production to a normal level — essentially curing the mice of Parkinson's disease for life.\r\n\r\nNext steps and cautious optimism\r\nThe researchers' next step is to improve their procedure in other mouse models of Parkinson’s disease, before testing it on human patients, reports the Financial Times.\r\n\r\nNeuroscientists who were not involved in the study have responded with cautious optimism to the findings.\r\n\r\n“While the principle of this study is remarkable and promising, it is important to note that it was conducted in mice,” said Tara Spires-Jones, a professor at the University of Edinburgh. “There is a long way to go to translate this into a treatment for people.”\r\n\r\nFu added: “It is my dream to see this through to clinical trials [and] to test this approach as a treatment for Parkinson's disease, but also many other diseases where neurons are lost, such as Alzheimer’s, Huntington’s disease and stroke.”\r\n\r\n\"And, dreaming even bigger — what if we could target PTB to correct defects in other parts of the brain, to treat things like inherited brain defects?\" said Fu.\r\n\r\nIf Fu's dream comes true, his work could revolutionize medicine by changing the way we treat degenerative diseases, and might effectively cure for Parkinson's disease, perhaps along with many other debilitating degenerative diseases.",
    "title": "This One-Time Neuron Treatment Reversed Parkinson's Disease in Mice"
}