{
    "url": "https://singularityhub.com/2020/11/05/this-baby-horse-was-cloned-using-dna-that-was-frozen-for-40-years/",
    "text": "This Baby Horse Was Cloned Using DNA That Was Frozen for 40 Years By Vanessa Bates Ramirez - Nov 05, 2020 3,694 When Dolly the sheep was born in 1996, she instantly achieved worldwide fame for being the first-ever animal to be cloned from an adult cell. Since then, she hasn't had many competitors for the title of \"world's most famous cloned animal.\" Other animals have been cloned, but just haven't made as many waves in the news. There's the lab in South Korea that clones dogs for a hefty price tag (around $100k). Two macaque monkeys were cloned in China in 2018. There's even a company that clones elite horses (along with dogs and cats). This summer another animal was added to the list, except the methodology scientists used to clone it was a little different—and a pretty wild example of the wonders science can accomplish these days. Kurt the horse was born in Texas this past August. But he's not just any horse; he's a Przewalski's horse , an endangered species of wild horse that comes from central Asia (primarily Kazakhstan, Mongolia, and western China). There hasn't been one seen in the wild since 1969; in the second half of the 20 th century the species' population declined because of human and livestock taking over the land they inhabited and extra-harsh winters. In Mongolian folk tales Przewalski's horses were seen as the \"riding mounts of the gods,\" and Mongolians thus call the horses \"takhi,\" meaning spirit or holy. Przewalski's horses look a bit different than what you probably picture when you think of a horse. They're shorter and stockier and have round protruding bellies, as well as thick, spiky-looking manes. Their heads resemble those of ponies or mules in that they're bigger in proportion to the rest of the body. Dolly the sheep was cloned using somatic cell nuclear transfer, a technique where scientists take the nucleus out of a healthy, unfertilized egg and replace it with the nucleus from a somatic cell (any cell other than a reproductive cell) from the animal being cloned. The resulting embryo is implanted into a surrogate, and the surrogate gives birth to a clone of the animal that donated the nucleus. Kurt the Przewalski's horse was made using this technique, too, except there's a twist: the cells used to make him had to be defrosted after 40 years of cryopreservation (aka, being frozen) at San Diego Zoo's Frozen Zoo (which, by the way, merits further mention on its own: it's the biggest and most diverse collection of its kind in the world, with over 10,000 living samples representing almost 1,000 species). Wait, what? That's right. Kurt is a clone of a horse named Kuporovic who was born in 1975 in the UK. Kuporovic wasn't a purebred Przewalski's horse—he was descended from a hybrid line of horses that were only part Przewalski's—but he had ancestry from 2 of just 12 Przewalski's horses that were saved from extinction in the early 1900s, and he had more genetic variation than any of his living relatives. Did someone say most eligible bachelor? It didn't go unnoticed. Scientists took a sample of Kuporovic's cells in 1980 and froze them. The horse had several offspring the natural way before passing away in 1998. His successor clone—Kurt—contains his exact genetic material, and the hope is that once he's old enough, he'll mate and produce offspring of his own, thus upping the number of his species (which currently stands at around just 2,000). So far, at three months old, Kurt is healthy and is developing normally. This points toward cryopreserved genetic material being a viable way to create clones, even after 40 years in the freezer. This isn't the first time frozen cells have been used to clone or create an animal; scientists in Japan created clones of bulls in 2009 using material that had been frozen for 10 years, and sperm samples frozen for 20 years were used to inseminate female black-footed ferrets (though their offspring weren't clones since half their chromosomes came from the living mother). Though the concept of cloning definitely has a creepiness factor attached to it, it's an incredibly useful way for scientists to study species and, as in the case of Kurt, try to save species that are endangered. They haven't quite succeeded in cloning a woolly mammoth yet (and whether that's a good or a terrible idea is up for debate), but it may just be a matter of time. Image Credit: Scott Stine/Revive & Restore TAGS Genetics Vanessa Bates Ramirez Vanessa is senior editor of Singularity Hub. She's interested in renewable energy, health and medicine, international development, and countless other topics. When she's not reading or writing you can usually find her outdoors, in water, or on a plane. Learn More Follow Vanessa: Latest There Could Be 300 Million (or More) Earth-Like Planets in Our Galaxy This Week's Awesome Tech Stories From Around the Web (Through November 7) A New and Improved Burger Robot's on the Market—and Everyone Wants One RELATED A CRISPR Baby Future? New Report Outlines Path to Human Germline Editing Scientists Gene-Hack Cotton Plants to Make Them Every Color of the Rainbow A Year After Gene Therapy, Boys With Muscular Dystrophy Are Healthier and Stronger Don't miss a trend. Get Hub delivered to your inbox Resilience Is the New Black: The Lessons of Covid-19 Singularity Hub About Creative Commons Pitch Us Contact Us Archive Terms of Use Privacy Policy Singularity University About Faculty Speaker Request Careers Programs Community Get the latest news from Singularity Hub! Sign Up Singularity University, Singularity Hub, Singularity Summit, SU Labs, Singularity Labs, Exponential Medicine, Exponential Finance and all associated logos and design elements are trademarks and/or service marks of Singularity Education Group. © 2020 Singularity Education Group. All Rights Reserved. Singularity University is not a degree granting institution.",
    "title": "This Baby Horse Was Cloned Using DNA That Was Frozen for 40 Years"
}