{
    "url": "https://techcrunch.com/2020/06/25/waymo-volvo-partner-to-develop-electric-robotaxis/",
    "text": "Waymo's self-driving software footprint is expanding this time in a partnership with Volvo Car Group. The two companies announced Thursday an exclusive partnership to integrate Waymo's self-driving software into a new electric vehicle designed for ride-hailing.\r\n\r\nVolvo and Waymo provided few details on the partnership and what this might actually look like except that the companies will first work together to integrate the Waymo Driver into an all-new mobility-focused electric vehicle platform for ride hailing services. The phrase first work together suggests more is coming. We know that the new vehicle platform will be capable of Level 4 autonomy, a designation by SAE that means it can handle all driving in a specific geographic area or in certain weather and road conditions.\r\n\r\nThe partnership also includes other subsidiaries under Volvo Car Group, including electric performance brand Polestar and Lynk & Co. International, a point that Volvo Car Group CTO Henrik Green specifically noted in his prepared statement. Fully autonomous vehicles have the potential to improve road safety to previously unseen levels and to revolutionize the way people live, work and travel,” Volvo Car Group CTO Henrik Green said in a statement. “Our partnership with Waymo opens up new and exciting business opportunities for Volvo Cars, Polestar and Lynk & Co.”\r\n\r\nThe term “exclusivity is also used to describe the partnership. But without specific details its hard to know where this is headed and what “exclusive” actually means. The exclusivity term is used to describe Waymo's Level 4 self-driving software, which suggests that the two companies might be co-developing or certainly sharing sensitive information on the inner workings of the stack. It also hints that the partnership is structured to include a possible licensing deal.\r\n\r\nWaymo's strategy so far has been to partner with automakers. Waymo handles the design of its hardware suite, software and compute system. It then works with the automakers to create vehicles that integrate easily with its so-called Waymo Driver. These relationships have largely focused on ride-hailing applications, but could be customized to make the vehicles more suitable for local delivery, trucking and personal car ownership.\r\n\r\nIf a licensing deal between the two companies materializes, it could be similar to Waymo’s partnership with Fiat Chrysler Automobiles. In May 2018, FCA announced it expanded its contract with Waymo to supply the self-driving car company with up to 62,000 Chrysler Pacifica Hybrid minivans. FCA also said at the time that it was exploring ways to license Waymo’s self-driving car technology in order to deploy the tech in cars for consumers.\r\n\r\nWaymo has a supplier partnership with Jaguar Land Rover  for up to 20,000 all-electric I-Pace vehicles. In June 2020, Waymo locked in a partnership with Renault and Nissan to research how commercial autonomous vehicles might work for passengers and packages in France and Japan.\r\n\r\nDon’t forget that Volvo still has a deal with Uber  self-driving unit Uber Advanced Technologies Group. Both Volvo and Uber ATG confirmed that its four-year partnership is still intact. Under that partnership, Volvo is supplying Uber with a vehicle designed for autonomous driving. These special Volvo XC90 vehicles are equipped with the hardware necessary to support Uber's self-driving software. Uber then integrates its self-driving software stack into the vehicle. Volvo said it has a framework agreement with Uber to deliver tens of thousands of autonomous drive-ready vehicles.",
    "title": "Waymo, Volvo partner to develop electric robotaxis"
}