{
    "url": "https://www.theverge.com/2020/11/5/21551926/apple-privacy-developers-nutrition-labels-app-store-ios-14",
    "text": "Apple will require apps to add privacy nutrition labels starting December 8th The labels explain what data is collected at a glance By Ian Carlos Campbell @soupsthename Nov 5, 2020, 8:42pm EST Share this story Share this on Facebook Share this on Twitter Share All sharing options Share All sharing options for: Apple will require apps to add privacy ‘nutrition labels' starting December 8th Linkedin Reddit Pocket Flipboard Email Image: Apple Apple debuted a collection of privacy features when it announced iOS 14, but the company's privacy \"nutrition label\", concept did not arrive with the launch of the new operating system in September. Today, Apple announced that developers will be required to provide the information for those \"labels\" starting December 8th. Like a normal nutrition label that lists ingredients and caloric content, these privacy \"labels\" should give you a better idea of what's going on inside an app before you download it from the iOS App Store or Mac App Store. The labels will list what information an app collects, and present that visually on the app page, much like looking at the backs of labels in a grocery store. A mockup of an iPhone displaying the App Store labels Image: Apple The catch, of course, is that while developers are required to disclose this information to continue releasing and updating apps, all of the information developers provide will be self-reported, which could still leave some possibility for foul play . Apple's Developer site cautions that developers will be required to disclose all the information they and their third-party partners collect and keep their \"labels\" up to date. For example, if an app needs to know your precise location to work, you'll know that before you even download it. If GPS functionality is ever removed from the app, a new label will have to reflect that. Apple does offer some exceptions when these label disclosures are optional, but the important thing to know that if an app intends to track you consistently, you'll know about it before it's on your phone. Providing this information is an easier-to-digest way to keep users informed on how exactly their phone is being used to track them. Apple already aggressively manages permissions inside apps, but these labels could be an even earlier line of defense. Developers can start submitting their apps' information now ahead of the December 8th deadline. Next Up In Policy Verge Deals Apple's AirPods are $60 off this weekend Plus, get $50 off the Apple Watch SE. Amazon's Fire tablets are also discounted The Apple Watch SE is $50 off for the first time at Target Plus, get a set of Sony wireless earbuds for just $68 You can still get a set of AirPods for just $100 Plus, check out today's new deal on the Ring Floodlight Cam More in Verge",
    "title": "Apple will require apps to add privacy nutrition labels starting December 8th"
} 