{
    "url": "https://techcrunch.com/2020/11/05/whatsapp-now-lets-you-post-disappearing-messages-which-go-away-after-7-days/",
    "text": "Ingrid Lunden Manish Singh 4 days Facebook recently announced that WhatsApp passed the whopping milestone of 100 billion messages sent per day, but not everyone wants those chats to stick around forever. Now, Facebook's wildly popular messaging app with 2 billion users is adding a feature to give people more control on how their words and pictures live within the app. From today, messages — including photos and videos — can now be marked to disappear after seven days. Disappearing messages are being rolled out globally across Android and iOS starting today, WhatsApp said. While it's starting with a seven-day lifespan, it is already looking at playing around with the time limits. “We will keep an eye on feedback about how people are using it and liking it and see if it needs adjusting in the future,” a spokesperson said. “For now we are starting with seven days, because it feels like a nice balance between the utility you need for global text-based conversations and the feeling of things not sticking around forever.” And just to be clear, the seven-day limit will exist regardless of whether the message gets read or not. (The disappearing message clock starts counting when the message is sent, as it does on other apps like Telegram.) WhatsApp is now delivering roughly 100 billion messages a day “The way it's currently designed is to give the sender confidence that after seven days their message is gone. The messages have no concept of being seen, for them to disappear, so they will disappear regardless of read status,” said the spokesperson. Users can turn on the feature for direct messages, but in groups it's the admin that has to enable disappearing messages for it to work. Although today is the “official” announcement, eagle-eyed WhatsApp watchers had spotted the company posting FAQs on the feature some days ago. And tests of the feature actually first started to appear — and, fittingly, disappear — as early as March of this year. This isn't WhatsApp's first rodeo with disappearing content. In 2017 , the company first dabbled in the idea with the launch of Status — an encrypted clone of Snapchat's Stories feature, which let people set up short updates on themselves — in the form of some text and/or a GIF — as essentially a “profile” for all of their contacts to see for a set period of 24 hours, with the Statuses existing in their own tab in the app separate from your chats. It's not clear how popular the Status feature is these days: we've reached out to ask. Anecdotally, we've seen younger people using it a lot , where it lives as a proxy, pared-down version of updating your status on Facebook or Snapchat; older people less so. WhatsApp said that one of the reasons it's taken its developers so long to bring the ephemeral feature to the wider chat experience is in part because of the encrypted aspect of the app: “[End-to-end encryption] was partly why it took us so long to implement this feature, because we wanted to retain the e2e capabilities that WhatsApp users expect and love,” the spokesperson said. But in any case, it's a very long time in coming. Ephemerality has been one of the most radical and sticky features in messaging in years — it has now been around for close to a decade. And it has arguably been the defining feature for one of the runaway, viral hits of the genre, Snapchat — so much so that clones of the feature have popped up in a number of other apps, from those focused first and foremost on privacy like Signal and Telegram, through to those that are aimed at more casual consumer audiences, like WhatsApp today. And there could be signs that Facebook may be looking to roll this out in other apps in its stable, too. Earlier this year it tested disappearing messages in Instagram , which now works officially . However, in Messenger, the most recent tests for disappearing text seem to be from 2015 , but it does have a “ secret ” messaging feature (launched in 2016 ) that lets the sender control how long a message remains. This, however, is not quite the same as something baked into the main messaging experience. The new disappearing messaging feature is coming amid some other notable additions in the app that appear to be in aid of the general purpose of giving more control to users. Earlier this week, WhatsApp announced that it would enable a new storage feature in the app: specifically, an easier way to control how and where photos and other media that you are sent live. This is especially important for active (but perhaps not deep) users of the app, who find their storage is getting gobbled up by innocuous GIFs, photos and videos sent over the app by friends and acquaintances. Facebook adds hosting, shopping features and pricing tiers to WhatsApp Business At the same time, it has also been beefing up the services it offers to businesses , and testing out business models for charging them, one way to stick to their commitment not to put ads into the service. The acceleration we're seeing in adding more features to the app in recent times is notable, too, given how Facebook didn't do much to update the features for years at a time before this, possibly to its detriment as the app faced a string of controversies over how it got abused by some. As with the storage changes, the new disappearing feature will not be switched on for users by default: you have to proactively change the settings.",
    "title": "WhatsApp now lets you post ephemeral messages that disappear after 7 days"
}