{
    "url": "https://newatlas.com/medical/stentrode-brain-implant-mind-control-first-trials/",
    "title": "Brain implant allows mind control of computers in first human trials",
    "text": "Human trials for a first-of-a-kind device designed to treat the brain via electrical stimulation have brought some very promising results. Called Stentrode, the implant has the potential to treat a wide range of neurological conditions, but in these very first trials, has brought about significant quality-of-life improvements for a pair of Australian men suffering from motor neurone disease (MND). We got our first glimpse at the Stentrode device back in 2016, when researchers in Australia demonstrated a new kind of implant in the brains of sheep. The idea was to offer a way of recording brain activity and stimulating the organ without needing invasive surgery where a piece of the skull is carved out to insert wires and electrodes. Instead, Stentrode can be implanted through a small keyhole incision in the neck, with the matchstick-sized device then guided through a blood vessel by X-ray until it rests over the motor cortex, the brain region responsible for planning and carrying out voluntary movements. Here it is able to monitor electrical signals coming from the brain, and also stimulate brain regions that correspond with particular muscle movements, as demonstrated in the pre-clinical trials on sheep. Stentrode was implanted into a human patient for the first time in August last year, and then into another subject in April of this year. These two Australian men both suffer from MND, with both now using the technology at home as part of their day-to-day activities.\n\nPhillip O'Keefe, the second recipient, has lost strength and flexibility in his arms over the past six month due to the progression of the disease, which slowly kills neurons in the brain and eventually leads to paralysis. This has left him unable to use a computer keyboard with his hands, but he is now finding some success using the Stentrode device instead.\n\nThe implant records his brain activity and transmits it wirelessly to a small receiver worn on his chest, and onward to a computer that translates the signals into onscreen commands. Throughout the trial, both subjects were able to use the device in this way to carry out click-and-zoom actions with an accuracy of more than 90 percent. They could also type at speeds of up to 20 characters per minute.\n\nIt's about re-training your brain to operate in a different way, says O'Keefe. It's just concentration, but like riding a bike it becomes second nature."
} 