{
    "url": "https://9to5google.com/2020/06/25/alphabet-north-focals/",
    "text": "While Glass lives on as an enterprise product, it never came close to reaching Google's wildly ambitious vision of replacing the smartphone. Others have since entered the smart glasses space, with North being one of the more notable players. Alphabet is now rumored to be acquiring North after Focals sold poorly.\nThe Globe and Mail this evening reports that North is in the \"final stages\" of an acquisition from Alphabet. Google's parent company is said to be paying $180 million for the Canadian company. This comes after North in December stopped selling Focals to focus on launching second-generation smart glasses sometime in 2020. \"Focals 2.0\" has been teased over the past several months with North claiming that they would be the \"most significant product introduction to date in the category.\" A \"lighter\" and \"sleeker\" design would have a \"10x display,\" while miniaturizing the technology by 40%. Sales of the first-generation device are described as \"minuscule\" in today's report: One person close to the sales operations says it's unlikely North sold many more than 1,000 pairs. Its only retail stores, in Toronto and Brooklyn, N.Y., often went days without a single sale. North made a major sales push at the start of 2019 with a price cut from $999 to $599. Buying Focals required a fitting process where a 3D model of your face is made. This capture rig was originally only available at two physical retail stores, but North later turned to pop-up locations and scanning via iPhones. In ending sales, North has not been bringing in any revenue, and the company is running out of money even after slashing monthly spending in half to $3 million. Despite taking on additional investment and loans, North is said to have started looking for a buyer earlier this year. Today's report identifies Alphabet as the acquirer. It's not clear if that's actually the case as North and Focals would make more sense within Google's AR & VR division rather than as a standalone Alphabet company.",
    "title": "Alphabet reportedly buying North after ‘minuscule' Focals smart glasses sales"
}