{
    "url": "https://techcrunch.com/2020/06/29/india-bans-tiktok-dozens-of-other-chinese-apps/",
    "text": "The Indian government on Monday evening said it was banning 59 apps developed by Chinese firms over concerns that these apps were engaging in activities that threatened “national security and defence of India, which ultimately impinges upon the sovereignty and integrity of India” in what is the latest standoff between the world’s two most populated nations.\r\n\r\nAmong the apps that India’s Ministry of Electronics and IT has ordered to ban include ByteDance’s TikTok,  which counts India as its biggest overseas market; Community and Video Call apps from Xiaomi, which is the top smartphone vendor in India; two of Alibaba Group’s apps (UC Browser and UC News); Shareit; CM Browser, Club Factory, which claims to be India’s third-largest e-commerce firm; and ES File Explorer.\r\n\r\nThis is the first time that India, the world’s second largest internet market with nearly half of its 1.3 billion population online, has ordered to ban so many foreign apps. New Delhi said nation’s Computer Emergency Response Team had received many “representations from citizens regarding security of data and breach of privacy impacting upon public order issues.”\r\n\r\n“The compilation of these data, its mining and profiling by elements hostile to national security and defence of India,” it said.\r\n\r\n Tarun Pathak, an analyst at research firm Counterpoint, said the order would impact roughly one in three smartphone users in India. TikTok, Club Factory and UC Browser and other apps put together had more than 500 million monthly active users in May, according to one of the top mobile insight firms.\r\n\r\nAnd, 27 of these 59 apps were among the top 1,000 Android apps in India last month, according to the mobile insights firm — data of which an industry executive shared with TechCrunch.\r\n\r\nIt’s unclear what exactly the “ban” means and how mobile operating system makers and internet service providers are expected to comply. At the time of writing, all of the aforementioned apps were available to download from Google  Play Store and Apple’s App Store in India.\r\n\r\nGoogle said it had yet to receive the order from New Delhi. Apple  said it was reviewing the order. The companies have traditionally complied with such app removal requests.\r\n\r\nNew Delhi said it had received “many complaints from various sources, including several reports about misuse of some mobile apps available on Android and iOS platforms for stealing and surreptitiously transmitting users’ data in an unauthorized manner to servers which have locations outside India.”\r\n\r\nMonday evening’s announcement is the latest standoff between the two neighboring nations following a deadly clash at the border earlier this month that stoked historical tensions. In recent weeks, custom officials at major Indian ports and airports have halted clearances of industrial consignments coming from China. Jayanth Kolla, an analyst at research firm Convergence Catalyst, told TechCrunch the move was surprising and will have huge impact on Chinese firms, many of which count India as their biggest market. He said banning these apps would also hurt the livelihood of several Indians who directly or indirectly work for them.\r\n\r\nAnti-China sentiment has been gaining mindshare in India in recent weeks, since more than 20 Indian soldiers were killed in a military clash in the Himalayas earlier this month. “Boycott China” — and variations of it — has been trending on Twitter in India ever since as a growing number of people posted videos demonstrating destruction of Chinese-made smartphones, TVs and other products.\r\n\r\nChinese smartphone makers command more than 80% of the smartphone market in India, which is the world’s second largest. For SoftBank-backed TikTok, which has more than 200 million monthly active users in India, New Delhi’s move is its latest headache. The Chinese firm has also faced scrutiny in Europe and the United States in recent quarters.\r\n\r\nTikTok has been facing backlash in India since the second half of May after users unearthed and shared numerous recent TikTok videos on Twitter that appeared to promote domestic violence, animal cruelty, racism, child abuse and objectification of women. Many in India rushed to leave a poor rating of the TikTok app in the Google Play Store to express their disgust — and the Android-maker had to intervene and delete millions of comments.\r\n\r\nDays later, an app called “Remove China Apps” gained popularity among some Indians. Google pulled the app later from the Play Store citing it violated its guidelines. A TikTok spokesperson did not immediately respond to a request for comment.\r\n\r\nIn April, India amended its foreign direct investment policy to require all neighboring nations, including China, with which it shares a boundary to seek approval from New Delhi for their future investments in India. The nation’s Department of Promotion of Industry and Internal Trade said it was taking this measure to “curb the opportunistic takeover” of Indian firms that are grappling with challenges due to the coronavirus crises.\r\n\r\nWhen TikTok app was blocked in India for a week last year, ByteDance had said in a court filing that it was losing more than $500,000 a day in the nation. In a statement on Tuesday (local time), TikTok said that it was working to comply with New Delhi’s order.",
    "title": "India bans TikTok, dozens of other Chinese apps"
} 