{
    "url": "https://www.scraperapi.com",
    "text": "Scraper API - Proxy API for Web Scraping Scraper API handles proxies, browsers, and CAPTCHAs, so you can get the HTML from any web page with a simple API call! FREE SIGNUP CONTACT SALES Get started with 1000 free API calls. No credit card required. Proxy API for Web Scraping Scraper API handles proxies, browsers, and CAPTCHAs, so you can get the HTML from any web page with a simple API call! FREE SIGNUP CONTACT SALES Get started with 1000 free API calls. No credit card required. We handle 5 billion API requests per month for over 1,500 businesses and developers around the world Never Get Blocked One of the most frustrating parts of automated web scraping is constantly dealing with IP blocks and CAPTCHAs. Scraper API rotates IP addresses with each request, from a pool of millions of proxies across over a dozen ISPs, and automatically retries failed requests, so you will never be blocked. Scraper API also handles CAPTCHAs for you, so you can concentrate on turning websites into actionable data. Fully Customizable Scraper API is not only easy to start with, it's also easy to customize. Scraper API allows you to customize request headers, request type, IP geolocation and more. Easily render javascript with a headless browser simply by setting render=true. Create sessions to reuse IP addresses multiple times. See our documentation for more details. Fast and Reliable We automatically prune slow proxies from our pools periodically, and guarantee unlimited bandwidth with speeds up to 100Mb/s, perfect for writing speedy web crawlers. With redundant proxy infrastructure spanning 20 different ISPs, we offer unparalleled speed and reliability so you can easily build scalable web scrapers. Contact our friendly customer support if you run into any trouble! 40+ Million IPs Let Scraper API proxy your requests through 40 million IP addresses from a dozen service providers located in over a dozen countries, with a mixture of datacenter, residential, and mobile proxies to increase reliability and avoid IP blocks. 12+ Geolocations We offer geotargeting to 12 countries, with 50 more available upon request, so you can get accurate, localized information from around the world without having to rent multiple proxy pools. Easy Automation We make it our mission to put developers first, this means handling a lot of the complexity on our end, automating IP rotation, CAPTCHA handling, and rendering javascript with headless browsers, so our users can scrape any page with a simple API call. 99.9% Uptime Guarantee We understand that data collection is critical infrastructure for businesses. This is why we provide best in class reliability, and offer a 99.9% uptime guarantee to all of our customers large and small. Unlimited Bandwidth Unlike most proxy providers, every proxy scraper API uses allows for unlimited bandwidth, meaning you are charged only for successful requests.",
    "title": "Scraper API"
}