{
    "url": "https://www.theverge.com/2020/6/26/21297400/microsoft-retail-stores-closing-cities-open",
    "text": "Microsoft is giving up on physical retail. Today the company announced plans to permanently close all Microsoft Store locations in the United States and around the world, except for four locations that will be \"reimagined\" as experience centers that no longer sell products. Those locations are New York City (Fifth Ave), London (Oxford Circus), Sydney (Westfield Sydney), and the Redmond campus location. The London store only just opened about a year ago. All other Microsoft Store locations across the United States and globally will be closing, and the company will concentrate on digital retail moving forward. Microsoft says Microsoft.com and the Xbox and Windows storefronts reach \"up to 1.2 billion monthly customers in 190 markets.\" The company tells The Verge that no layoffs will result from today's decision. \"Our commitment to growing and developing careers from this diverse talent pool is stronger than ever,\" Microsoft Store VP David Porter said in a LinkedIn post on the move. A source with knowledge of Microsoft's retail operations told The Verge that this plan was originally in place for next year, but was accelerated by the COVID-19 pandemic. Microsoft's Xbox Series X is launching this holiday, so it makes sense that the company had at least initially planned for the stores to make it that far. The dual-screen Surface Neo device that was also going to ship during the holidays has been delayed, though the Surface Duo is apparently still on track for this year. Still, if you were hoping your local Microsoft Store would be a surefire bet for a new Xbox, you'll have to look elsewhere. The big decision partially explains why Microsoft had yet to reopen a single store after they were all closed in light of the pandemic. Last week, Microsoft told The Verge that its \"approach for re-opening Microsoft Store locations is measured and cautious, guided by monitoring global data, listening to public health and safety experts, and tracking local government restrictions.\" At the time, the company declined to offer an update on when any stores might open again. Since many Microsoft stores are in shopping centers and malls, the continued closure hasn't stood, out as unusual. In US states that are taking a cautious approach to restoring retail operations — to avoid a resurgence of the novel coronavirus — most malls remain closed. There have already been spikes of COVID-19 cases in regions with more relaxed guidelines, which has led Apple to re-close some stores where it had only recently welcomed customers back in. In April, Microsoft outlined in a blog post how many retail store associates had shifted to remote work after their everyday jobs were sidelined. The company has continued to provide regular pay for team members through the pandemic. \"Our retail team members will continue to serve customers working from Microsoft corporate facilities or remotely and we will continue to develop our diverse team in support of the overall company mission and objectives,\" the company said in today's update. The Microsoft Store debuted in 2009 and closely adhered to Apple's successful retail playbook. Each store is a showcase for the company's Surface and Xbox hardware, plus a selection of third-party PCs. Employees were well-versed in all things Windows, and the company also offered in-store events, workshops, customer service, and repairs. The stores were were closed even before Microsoft's latest hardware release cycle that included the Surface Book 3, Surface Go 2, Surface Earbuds, and Surface Headphones 2.",
    "title": "Microsoft to permanently close all of its retail stores"
} 